Changed ascii diagrams to mermaid diagrams and removed unnecessary restore flows
